---
kind: other
id: Properties.T:Autodesk.Revit.DB.BoundarySegment
source: html/1f9191b9-c76e-bdb4-138f-e7cc5c2163ec.htm
---
# BoundarySegment Properties

Retrieve the id of the element that produces this boundary segment.
 If the segment is created from an element in a link, this is the id of the RevitLinkInstance.